
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры
&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("Номенклатура", ВыбраннаяСтрока);
	
	НайденнаяСтрока = ПозицииПродажи.НайтиСтроки(Фильтр);
	Если НайденнаяСтрока.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
		
	Строка = ПозицииПродажи.Добавить();
	Строка.Номенклатура = ВыбраннаяСтрока;
	Строка.Цена = ДанныеСтроки.Цена;
	Строка.Количество = 1;
	Строка.Сумма = Строка.Цена;
	
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
